tap "homebrew/bundle"
brew "automake"
brew "bison"
brew "chruby"
brew "gdbm"
brew "go"
brew "just"
brew "libffi"
brew "libyaml"
brew "mysql"
brew "opam"
brew "openssl@1.1"
brew "readline"
brew "ruby-install"
brew "rust"
brew "starship"
cask "postman"
cask "visual-studio-code"
cask "zed"
vscode "alefragnani.Bookmarks"
vscode "alexandernanberg.horizon-theme-vscode"
vscode "alexkrechik.cucumberautocomplete"
vscode "andrewmarkle.primer-light"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "cschlosser.doxdocgen"
vscode "dafny-lang.ide-vscode"
vscode "DavidAnson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "evzen-wybitul.magic-racket"
vscode "felipe-mendes.slack-theme"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "haskell.haskell"
vscode "Hyzeta.vscode-theme-github-light"
vscode "Ionide.Ionide-FAKE"
vscode "Ionide.Ionide-fsharp"
vscode "Ionide.Ionide-Paket"
vscode "jaredkent.laserwave"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "justusadam.language-haskell"
vscode "karyfoundation.racket"
vscode "karyfoundation.theme-karyfoundation-themes"
vscode "loilo.snazzy-light"
vscode "mathiasfrohlich.Kotlin"
vscode "mattn.Lisp"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "mvllow.rose-pine"
vscode "redhat.java"
vscode "RobbOwen.synthwave-vscode"
vscode "rokoroku.vscode-theme-darcula"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "skellock.just"
vscode "teabyii.ayu"
vscode "tomoki1207.pdf"
vscode "tomphilbin.gruvbox-themes"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-maven"
vscode "wayou.vscode-todo-highlight"
