tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
brew "automake"
brew "libyaml"
brew "openssl@3"
brew "readline"
brew "asdf"
brew "bazelisk"
brew "bison"
brew "brotli"
brew "python@3.12"
brew "chruby"
brew "openjdk"
brew "clojure"
brew "cmake"
brew "deno"
brew "difftastic"
brew "docker"
brew "gdbm"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "gnu-tar"
brew "go"
brew "hyperfine"
brew "just"
brew "kotlin"
brew "libffi"
brew "mysql"
brew "node"
brew "nvm"
brew "opam"
brew "openssl@1.1"
brew "pandoc"
brew "ruby"
brew "ruby-install"
brew "rust"
brew "starship"
brew "stow"
brew "typescript"
cask "dotnet-sdk"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "obsidian"
cask "temurin17"
cask "visual-studio-code"
vscode "alefragnani.bookmarks"
vscode "alexandernanberg.horizon-theme-vscode"
vscode "alexkrechik.cucumberautocomplete"
vscode "andrewmarkle.primer-light"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "cschlosser.doxdocgen"
vscode "dafny-lang.ide-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "evzen-wybitul.magic-racket"
vscode "felipe-mendes.slack-theme"
vscode "github.github-vscode-theme"
vscode "github.vscode-codeql"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "haskell.haskell"
vscode "hyzeta.vscode-theme-github-light"
vscode "ionide.ionide-fake"
vscode "ionide.ionide-fsharp"
vscode "ionide.ionide-paket"
vscode "jaredkent.laserwave"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "justusadam.language-haskell"
vscode "karyfoundation.racket"
vscode "karyfoundation.theme-karyfoundation-themes"
vscode "loilo.snazzy-light"
vscode "mathiasfrohlich.kotlin"
vscode "mattn.lisp"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "mvllow.rose-pine"
vscode "redhat.java"
vscode "robbowen.synthwave-vscode"
vscode "rokoroku.vscode-theme-darcula"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "skellock.just"
vscode "streetsidesoftware.code-spell-checker"
vscode "teabyii.ayu"
vscode "tomoki1207.pdf"
vscode "tomphilbin.gruvbox-themes"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wayou.vscode-todo-highlight"
