tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "oven-sh/bun" #Official tap for bun

# Languages && Runtimes
brew "python@3.12"
brew "clojure"
brew "kotlin"
brew "node"
brew "deno"
brew "bun"
brew "rust"
brew "go"
brew "ruby"
brew "scala"
brew "typescript"
brew "openjdk"
brew "ocaml"
cask "dotnet-sdk"   # Cask for latest dotnet SDK

# Ruby-specific
brew "chruby"
brew "ruby-install"

# Python-specific
brew "yapf"

# Java-specific
cask "temurin17"    # Alternative JVM by Adoptium (Eclipse) targetting Java17
brew "maven"
brew "google-java-format"

# OCaml-specific
brew "opam"

# Scala-specific
brew "sbt"

# CodeQL
cask "codeql"

# Version Managers
brew "asdf"
brew "nvm"          # Node Version Manager

# Compression
brew "brotli"       # Google compression algorithm
brew "gnu-tar"

# Git && Github
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gh"           # GitHub command line tool
brew "pre-commit"
brew "act"          # GH Actions local workflow runner - https://github.com/nektos/act

# Libraries
brew "libffi"
brew "libyaml"
brew "openssl@3"
brew "readline"
brew "openssl@1.1"

# Build systems & utilities
brew "cmake"
brew "bazelisk"     # Launcher of (wrapper around) Bazel Build System
brew "automake"
brew "bison"

# Containers, Virtualisation & DevOps utilities
brew "docker"       # Container engine
brew "qemu"         # Virtualisation & emulation engine
brew "ansible"      # Configuration management
cask "vagrant"      # VM Provisioning
brew "minikube"     # Local Kubernetes cluster
brew "container-structure-test" # Integrity checks on container images
brew "skaffold"     # Building & Deploying for Kubernetes

# Databases
brew "gdbm"         # GNU key-value store
brew "mysql"

# Networking tools
brew "nmap"
brew "telnet"

## Rust utilities
brew "hyperfine"
brew "just"
brew "difftastic"

# Terminal utilities
brew "starship"
brew "stow"         # Symlink management framework.
brew "bash-completion"
brew "tree"
brew "jq"           # Json-query
brew "yamllint"

# Fonts
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-monaspace"

# Other
brew "pandoc"       # Document format transformer
cask "logseq"       # Personal wiki
brew "cloc"         # Count lines of code
cask "zotero"       # Reference/Bibliography management

# Visual Studio Code && Extensions
cask "visual-studio-code"
vscode "alefragnani.bookmarks"
vscode "alexandernanberg.horizon-theme-vscode"
vscode "alexkrechik.cucumberautocomplete"
vscode "andrewmarkle.primer-light"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "cschlosser.doxdocgen"
vscode "dafny-lang.ide-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "evzen-wybitul.magic-racket"
vscode "felipe-mendes.slack-theme"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-codeql"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "haskell.haskell"
vscode "hyzeta.vscode-theme-github-light"
vscode "ionide.ionide-fake"
vscode "ionide.ionide-fsharp"
vscode "ionide.ionide-paket"
vscode "jaredkent.laserwave"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "justusadam.language-haskell"
vscode "karyfoundation.racket"
vscode "karyfoundation.theme-karyfoundation-themes"
vscode "loilo.snazzy-light"
vscode "mathiasfrohlich.kotlin"
vscode "mattn.lisp"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "mvllow.rose-pine"
vscode "redhat.java"
vscode "robbowen.synthwave-vscode"
vscode "rokoroku.vscode-theme-darcula"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "skellock.just"
vscode "streetsidesoftware.code-spell-checker"
vscode "teabyii.ayu"
vscode "tomoki1207.pdf"
vscode "tomphilbin.gruvbox-themes"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wayou.vscode-todo-highlight"
vscode "wengerk.highlight-bad-chars"
