# File with personal/entertainment dependencies,
# not synced to work computers.

tap "zackelia/formulae"     # for bclm

# Languages and Runtimes
cask "r"            # Prefer the cask for R as it contains official binaries
cask "racket"
brew "elixir"
cask "smlnj"        # StandardML New Jersey
brew "lua"

# Dart and flutter
cask "flutter"

# Python specific
cask "anaconda"

# R-specific
cask "rstudio"

## Notetaking Software
cask "notion"       # Personal wiki
cask "obsidian"     # Personal wiki

## Games and Game Engines
cask "steam"
cask "godot"
cask "love"         # Love2d (Lua game engine)

## Typesetting software
brew "typst"

## Editors
cask "sublime-text"
cask "zed"

## Others
brew "bclm"                  # battery management software
cask "zotero"                # Reference/Bibliography management
cask "db-browser-for-sqlite" # Database browser for SQLite 
brew "exercism"              # exercism.org CLI
brew "ollama"                # Local LLMs
brew "luarocks"              # Package management for lua
cask "obs"

## OU Maths Degree software
brew "maxima"
brew "wxmaxima"
brew "gnuplot"
